Revit 2027 API
EnergyDataSettings.ReportsFolder Property
 The folder path where all systems analysis reports are stored. It may include special label and relative path.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ReportsFolder { get; }
Public ReadOnly Property ReportsFolder As String
	Get
public:
property String^ ReportsFolder {
	String^ get ();
}
member ReportsFolder : string with get
Property Value
String
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace